[
  {
    "id": "1st-book-review-1757688447036",
    "title": "1st Book Review",
    "category": "Book and Show Recommendation",
    "date": "September 4, 2025",
    "image": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRASWfOYB_zZ1UaXYlJ12waPHgcGp8qznd9frOyNTDm7zdCc05v_jQznDyis6ubgFpCDGUuRQW83K9xv76vOz4EVNIFl9S92bLSOpUeh5mQ",
    "summary": "1st Book Review (Gravity Falls)",
    "fullDescription": "GRAVITY FALLS\nShow Recommendation by Van Ulrich\n\nGravity Falls is a mystery, a comedy, and a really fun time. The show follows twins Dipper and Mabel, and their summer trip to their Grunkle Stan’s Mystery Shack, a tourist trap mystery house. But the town they arrive in may be more strange than they first anticipated. I personally love this show because of the memorable characters that will steal your heart. The only problem I have with this show is that there is a lack of consequences and development with some of the characters' actions. Other than that, Gravity Falls holds a special place in my heart. Full of laughs, heart, and a thrilling mystery: Gravity Falls may be your next binge. (: \n",
    "author": "Van Ulrich",
    "featured": false
  },
  {
    "id": "1st-book-and-show-recommedation-1757688131369",
    "title": "1st Book and Show Recommedation",
    "category": "Book and Show Recommendation",
    "date": "September 4, 2025",
    "image": "https://m.media-amazon.com/images/I/81XQynW684L._UF1000,1000_QL80_.jpg",
    "summary": "1st Book Recommendation(Madoka Magica)",
    "fullDescription": "MADOKA MAGICA\nBook Recommendation by Minjii Peterson & Theo Royer\n\n\nMadoka Magica is a PG-14 psychological horror manga (that later got adapted to an anime) about a group of five middle school girls (Madoka Kaname, Homura Akemi, Mami Tomoe, Sayaka Miki, and Kyoko Sakura) who are approached by a creature named Kyubey who gives them the opportunity for any wish to be granted but they have to become a magical girl in return, in which they are forced into a life of killing witches and putting their lives on the line, until they all slowly realize the wish they made isn't worth the price they paid for. Now it's up to them to decide, will they face challenges or be crushed by the consequences? \n\n\nWhy we recommend  it: It's a great series, definitely worth the read and watch. The plot twists really brought it together!”⭐⭐⭐⭐⭐ -Minjii\n\n\n“Great storytelling and perfect for a quick read!”⭐⭐⭐⭐⭐-Theo",
    "author": "Theo Royer & Minjii Peterson",
    "featured": false
  },
  {
    "id": "example1",
    "title": "some article",
    "category": "Example Catagory",
    "date": "September 21, 2025",
    "image": "https://placehold.co/600x400/81C784/FFFFFF?text=Example",
    "summary": "Example summary",
    "fullDescription": "Example thing",
    "author": "Example author",
    "featured": true
  },
  {
    "id": "0905",
    "title": "Tal declares war upon cats",
    "category": "Satire",
    "date": "August 27, 2025",
    "image": "https://m.media-amazon.com/images/I/81ArCptOftL.jpg",
    "summary": "Tal declares war upon cats over a cardboard gingerbread house",
    "fullDescription": "In the past few years, tension between Tal and the Council of Kittens has been steadily growing over a cardboard gingerbread house/cat scratcher positioned right in between Tal’s land and the Cat’s Kittendom. Both Tal and the Council of Cats want this, though neither side has made any attempt to capture it. No official war started. Until now.\nA recent attack by the citizens of the Longhair village has broken this fragile peace, and Tal declared war soon after. Tal’s armies, along with being positioned near the gingerbread house, have shown some activity near the maine coon and Scottish-Fold fortresses, and are still awaiting retaliation. The Council of Kittens has contacted the dogs to request help in tearing Tal’s toilet paper. The Dogs, annoyed at the amount of tennis balls that Tal has been hoarding, agreed. Being a hydro superpower, Tal launched a water balloon towards the council of kittens’ base of operations, but the council learned of this attack and evacuated everyone just in time. We will continue this story as events unfold.\n",
    "author": "Bea Bristow",
    "featured": false
  },
  {
    "id": "cutbackdaplants",
    "title": "Time To Cut Back!",
    "category": "Opinion",
    "date": "September 5, 2025",
    "image": "https://placehold.co/600x400/81C784/FFFFFF?text=Example",
    "summary": "Why we need to cut back the plants behind the swings",
    "fullDescription": "Picture this: Your best friend is on the swingset during Brain Break, and she just misses kicking someone walking by in the head, but since her legs are bent, she’s up to her knees in the bushes. When she swings back up again, one of her legs is bleeding! How, though? She was cut by a sharp branch!\nThis grisly scenario could become reality if the plants behind the swings aren’t cut back. The bushes and branches have become a safety hazard to anyone wishing to have fun on the swings. People could get scratched, get bug bites, or even have vines loop around their body parts. Soccer balls can also get lost in the tangle. Multiple students are unhappy about this.\n“I was swinging once and a vine looped around my neck,” says  a student who prefers to remain anonymous. “I almost got pulled off the swing!”\nThat could have ended in disaster, and that’s not the only way a student could get hurt on the swings. Those plants are a lawsuit waiting to happen. It’s even worse this year, since they were left to grow uncultivated for an entire summer. Imagine if a nest of bees moved in, or if poison ivy started to grow! We’ve already had one student injured on the swings this year, and if these plants aren’t cut back, they won’t be the last.\nAnother reason the plants should be cut back is that balls keep getting lost in there, and students have to go into the unknown to get them back. That could be dangerous. We aren’t allowed to go into the woods to get balls back, so why should we have to go into the plants to get them? All of these problems can be resolved by just cutting back the plants. \n",
    "author": "Avery Fontenot",
    "featured": false
  },
  {
    "id": "example2",
    "title": "Example THING",
    "category": "Example Catagory",
    "date": "September 21, 2025",
    "image": "https://placehold.co/600x400/81C784/FFFFFF?text=Example",
    "summary": "Example summary",
    "fullDescription": "Example Description",
    "author": "Example author 2",
    "featured": false
  }
]