[
  {
    "id": "massive-development-at-ahs-1758735353166",
    "title": "Massive Development at AHS!",
    "category": "Major",
    "date": "September 23, 2025",
    "image": "https://media.canva.com/v2/image-resize/format:JPG/height:800/quality:92/uri:ifs%3A%2F%2FM%2F7d9f6103-f064-4842-84c8-34ca2c000437/watermark:F/width:600?csig=AAAAAAAAAAAAAAAAAAAAAK26U-U7Yoy9SPdiwnPtgx21Xr1vpspOCS3Vl9WYo8NQ&exp=1758749752&osig=AAAAAAAAAAAAAAAAAAAAABxzDubDPhijBcPiuoIxMKy1x1bhtVkqIE-d5CrtVV04&signer=media-rpc&x-canva-quality=screen",
    "summary": "New metal Detectors cause massive delays for all students!",
    "fullDescription": "Those on the Albemarle bus in the morning may have noticed a drastic change in the Albemarle morning schedule. For the last few days, AHS has required every student to undergo a thorough check with a metal detector before entering the building. This means that every morning, the lines reach down the sidewalk as nearly 2,005 students have to go to class late. Students are having to pull out their computers and phones, and remove their jewelry. What are the pros and cons of these decisions? How is this going to affect us at Lab? \n\nIt turns out that every high school student in Albemarle County is experiencing this. ACPS began piloting these school safety strategies in the fall of 2024, and put it into place on September 3rd at Monticello High School, September 4th at Western Albemarle, and September 5th at Albemarle High School. Fairfax County Public Schools, Loudoun County, Henrico County, Chesapeake Public Schools, and Norfolk City Public Schools are some other notable school districts that have taken up this procedure. \n\nThese procedures have been ensured with the help of OPENGATE Alarms. OPENGATE is a relatively well-known brand name when it comes to security systems, and it was designed with efficiency in mind. OPENGATE Alarms consist of two wireless pillars, and are easily transported, requiring no installation. The screeners will be active throughout the schoolday, making it almost impossible to get into a high school without going through the security system. OPENGATE Alarms were designed to only go off when something with high metal density passes through. Computers, umbrellas, three-ringed binders, and metal lunch boxes are all likely to set them off. If a student thinks that they have something that will set it off, they can pass it to the staff member next to the detectors.\n\nWhile this process may have a lot of positives, it certainly does have its downsides as well. While these processes were all designed to maximize efficiency, they haven't been running as smoothly as you might think. The lines are long, unorganized and take up a lot of space in front of the school. Because of the line sizes, students have to arrive to class later than they would previously. My own experience is just with Albemarle High School, but I would have to assume that other high schools are experiencing similar troubles. \n\nWhile these changes have pros and cons, I think that it’s really about what the students make of it. It’s also likely that this will get smoother over time, and we will learn to live with it. Which leaves one final question; how will this affect us? From personal experience I can say that it does slow down the Albemarle bus in the morning, and some students have to walk all the way around the line simply to get to the other side. But overall, I think that this is something that we will simply have to observe from the sidelines as it develops. \n",
    "author": "Addie Wray",
    "featured": true,
    "views": 0
  },
  {
    "id": "the-tal-vs-cat-conflict-continues-1758734697445",
    "title": "The Tal vs Cat conflict continues...",
    "category": "Satire",
    "date": "September 23, 2025",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYVPenCcSVrDLRLzAho3efkc0Y6cDa2WfOBsPErzY5LMW0Tes:https://assets1.csnews.com/images/v/max_width_1440/files/2021-07/Buc-ee%2527s-logo_0_0.jpg&s",
    "summary": "The war escalates...",
    "fullDescription": "In our previous article, we described the aspects and causes of the Tal v. Council of Kittens war, which ended in Tal’s launch of a water balloon. Since that article, the Council of Kittens regrouped and planned to stop Tal for good this time. Their plot was simple: ambush Tal while he’s trapped in a line. In what historians will forever call “The great Buc-ee’s battle,” Tal was lured into a Buc-ee’s by the cats, and the combined forces of the council pounced on him. Tal, however, was prepared. Expecting an attack at any moment, he brought a bag of cat treats with him. Aggressively throwing treats left and right, he left them defenseless and content. With all of the enemy forces subdued and in the same place, he called the vet and sent them all to get a checkup.",
    "author": "Bea Bristow",
    "featured": false,
    "views": 0
  },
  {
    "id": "game-day-highlights-school-lunch-soccer-recap-1758734090830",
    "title": "Game Day Highlights: School Lunch Soccer Recap",
    "category": "Sports",
    "date": "September 23, 2025",
    "image": "https://www.ncaa.com/_flysystem/public-s3/styles/stax_large_content_tile/public-s3/tile-images/hero/Women%27s-top-25-rankings.JPG?h=d3b2a6a9&itok=BGzmkInz",
    "summary": "Catch up with the latest games in our unofficial soccer league",
    "fullDescription": "There may be a bias in this article due to the majority of the writers being on one team; however, we will strive to minimize it. Also know that last brain break’s games are not counted, and that not all games are written about in this article, but are counted in the standings.\nGT = Graham’s team \nNT = Nico’s team\nSometimes Nico play’s on Graham’s team, but Teams stay the same for Brain Breaks, but sometimes at lunch, it will be Keelan’s team vs the 6th and 7th grade.\n\nGame Day 1 \n8/25, 1st BB: GT 4-0 NT. Today, the grass was so wet that Nico was unbelievably bad because the ball was wet, and he got his entire hand on the ball, but the ball still ended up in the goal, and Nico's team lacked attack.\n\n8/25, end of 1st BB: All the soccer players continued to play after the final whistle was blown, so Mae decided to discipline the players, and she asked what the punishment should be. Andrew suggested we play with a different ball. Mae agreed and said she will choose the ball we play for the next match.\n\n8/25, Lunch: GT 3-0 NT. This was a special game. For one thing, the ball was very deflated (thanks to Mae), so it was hard to kick very far. Bryant said it was the worst ball in the P.E. closet, and he was surprised it was still there. The teams were 6th and 7th grade against 8th grade and Keelan. Keelan finally decided to start playing soccer. Then, he played very well and scored 2 incredible goals. 8th and Keelan won by 3 goals, due to an outstanding performance from Keelan. For his first, he dribbled the ball past the entire defense. Then, a few minutes later, the ball came to him in the air, and he juggled it past the defense and hit a banger volley. But unfortunately, he only played for half of the time, since he had to go back to “talking to 9th graders”.\nZach scored one boring goal. \n\nGame Day 2\n8/26, 1st BB: GT 1-0 NT. This was a very close game with a dramatic last-minute goal by Zachary Storm. Nico played noticeably better than last time, managing to save 8 shots and only conceding a 1v1 goal from Zach. Graham also played a good game. He had 3 good saves. Both teams played at their best, but Zach won the game in the last second by dribbling past the entire team and poked the ball past Nico for the win. \n\n8/26, Lunch: Keelans team 1-2 6th + 7th. The 6th and 7th graders pulled off a surprising win against Keelan and the 8th graders. Jack (6th grade) scored the first goal of the match off the post. Keelan scored an absolutely amazing goal. Keelan broke two defenders' ankles and smashed the ball past the keeper. But then, everything went wrong. Keelan decided to go and do something else and so left the game. Levi got a 1 on 1 and shot. Nico made the first save, but Benton got the rebound and shot it. We couldn’t agree on whether it was over or not, so it was a penalty. Nico couldn’t make the save, and Levi scored the winning goal. \n  \nGame Day 3\n8/27, 1st BB: GT 3-0 NT. Nico’s team had many players out, so they suffered a bad loss due to three defenders doing nothing except blocking Nico's view of the ball. There were also 2 penalty shots. Sam took the first one and shot it right at Nico for an easy save. The next was a good shot into the bottom corner for a goal.\n\n8/27, Lunch: 8th + Keelan 0-0 6th + 7th. This was a fairly boring game, mostly because Keelan didn’t come to play, which resulted in low morale on both sides. Resulting in a 0-0 tie.\n\nGame Day 4\n9/4, 1st BB: GT 2-0 NT. In this game, Nico made an incredible double save. Jonah crossed the ball, and Cavan took ages to tap the ball into the net, so Nico had time to get up and make the first save. On the rebound, Sam shot the ball, and Nico reacted just in time to throw out an arm and make the save. The first goal came from a big deflection off of Miles, and Nico could not change directions in time. The second goal was because the defense was standing too close to Nico, so he could not see the ball. \n\n9/4, Lunch: GT 1-1 NT. Keelan wasn’t playing today, so not much exciting stuff happened. 2 goals were scored, though.\n\nGame Day 5 \n\n9/5, First BB:  GT 1-2 NT. For the first time this year, Nico's team pulled off a win. The first goal was scored by Tyler, giving Nico’s Team a 1-0 lead. Then there was a shot Nico saved, but it bounced off him and onto the post. Then it rolled on the goal line for what “seemed like forever,” said Nico, before Cavan tapped it in. The last goal was scored by Jack. Graham made a great double save on both shots from Jack, but the defence was nonexistent and failed to clear the ball. So Jack just shot the ball underneath Graham.  \n\nGame Day 5 \n9/8, First BB:  GT 1-2 NT. A lot of players, including Graham, weren’t playing because they were catching leaves. Because of this, the game wasn’t taken very seriously, so it won’t be counted towards the standings. People caught a bunch of leaves, though!\n\n9/8, Lunch: Keelans team 1-1 6th + 7th. Keelan scored yet another banger goal, even though he spent a lot of time catching leaves. Then later in the game, Levi scored the equalizer. Then, on one of the last plays of the game, Benton took a shot. It was right at Nico, but he gave up a rebound. Off the rebound, Benton shot it underneath Nico, but he managed to slow it down enough for Graham to clear it from the goal line.\n\nGame Day 6\n9/10, First BB: GT 0-0 NT. There were no real scoring chances in this match, but both goalies still made a few easy saves. Levi lost his shoe in a collision with Graham, but he didn’t bother to put it back on until the game ended.\n\n9/10, Lunch: GT 1-0 NT. For this game, Keelan joined Graham’s team and carried them to a 1-0 victory. Early on in the match, Lucas had a good cross to Cavan, who scored a nice tap-in goal. Later on, Keelan had an unbelievable bicycle kick shot, but he got unlucky, and it hit the post and bounced away. Levi and Benton both had a few chances, but they shot right at Graham, and he made the saves. \n\nGame Day 7\n9/11, First BB: GT 0-0 NT. This was an incredibly short game because brain break ended early. In the few minutes the game lasted, though, Jonah made a really powerful shot, and Nico stuck out his hand to block it at an awkward angle, and he injured his wrist. No one ended up scoring in this game.\n\n9/11, Lunch: GT 1-1 NT. Zach hasn’t been playing much lately, so the teams haven’t been 8th and Keelan versus 6th and 7th in a long time. So today, it was Graham’s team and Keelan against Nico’s Team. Nico was still injured, so he wasn’t playing goalkeeper and was instead a defender. Jack took over goalkeeping for the game. On the very first play of the game, Levi got the ball and dribbled toward the goal, but none of Graham’s defense knew the game had started, so Levi slotted the ball right into the side of the goal. Then later, midway through the game, Keelan dribbled the ball past the defense on the right side of the field, and from a very difficult angle, he shot a great power shot to the far side of the goal that was so perfect and hard it knocked over the post and bounced into the goal. Both teams had chances to score after that, but nobody did.\n\n                                                            Game day 8\n9/12, First BB: GT 0-0 NT. Great defense from Nico’s team, Graham was forced to make a few saves, including a horrible triple save. Graham's team had no shots while Nico's team had a ton.\n\nGame day 9\n9/15, First BB: GT 1-1 NT.  \n9/15, Lunch: GT 1-0 NT. Nico was not trying in goal this game, because he wanted to play defender instead. Levi did not let Nico play defender, though. Nico got mad and let in a shot from Cavan, so Graham’s team took the lead 1-0. “I told him that I did not want to play goalkeeper,” said Nico. \"He didn’t respect my decisions and made me play anyway, so I let a goal in on purpose.”\n\nGame day 10\n9/16, First BB: GT 5-1 NT.  In this game, Nico’s team got mad at Ben, and loaned him to Graham’s team. This proved to be a mistake, because Nico was still not playing goalie. Because of that, teams were stacked in favor of Graham’s team, and they took the opportunity in this blowout win, where Lucas scored 2, Ben scored 2, and Jonah scored \n\n9/16, Lunch: Keelan’s team 2-1 6th+7th. Everyone was graced by Keelan’s presence for this game, and the teams with 6th grade and 7th grade vs. all. Keelan scored one goal where he dribbled into the goal past the goalie, and Lucas scored another one from a long way out. Later in the game, Dylan scored a goal where he got the ball in midfield, dribbled up a little, and shot. Nico blocked part of it, but it just deflected it away from the way Graham had dove.\n\nGame day 11\nThere were no games today because brain break and lunch were both inside.\n\nGame day 12\n9/19 1st BB: GT 2-0 NT. Lucas scored two goals, because he thought of Keelan and it encouraged him to lock in. Benton played goalie because Nico was on the other team playing defense.  and powershot kid/Jack refused and was acting like it was the world cup final. \nGame day 13\n\n9/23 lunch GT 1-1 NT Lucas scored then powershot kid scored\n\nGame day 14\nNo games: Sadly football is colonizing soccer's land. Just like the early settlers in America, football is colonizing soccer's native land. \n\n \n",
    "author": "Nico Santoro, Lucas Nderitu, Zach Storm, and Graham Michael",
    "featured": false,
    "views": 0
  },
  {
    "id": "choosing-the-right-sport-for-you-1758733338208",
    "title": "Choosing The Right Sport For You",
    "category": "Opinion",
    "date": "September 23, 2025",
    "image": "https://npr.brightspotcdn.com/dims4/default/79f7691/2147483647/strip/true/crop/1500x993+0+0/resize/880x583!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Flegacy%2Fsites%2Fvpr%2Ffiles%2F201609%2Fsoccer-ball-istock-Ohmega1982.jpg",
    "summary": "Feeling stuck? Get active with these personalized sport recommendations!",
    "fullDescription": "Are you a couch potato? Is your best friend the TV? Do your parents yell at you daily to get some exercise? Are you someone who wants to do sports, but you can’t find one that’s right for you?\n\tIf your answer to all four of these questions was yes, then keep reading this article, because it’s going to go over the pros and cons of six sports, as well as the health benefits! Say goodbye to the old you and hello to the new you, an aspiring athlete! Every single one of these sports is offered in Charlottesville, Virginia, and are highly popular with boys and girls alike! Playing any one of them will definitely please your strict parental figure(s) and get you off the couch!\n\tFirst off, we have a sport that’s already incredibly popular on the CLS campus, a sport that’s played every single day outside! Yeah, I’m talking about soccer! (Or, as it is known literally everywhere else in the world, futbol.) There are several different positions you can play, including goalie, defense, midfield, and forward. The pros of playing soccer are as follows; improved cardiovascular health, increased confidence, social development, and cognitive development. Some of the health benefits of soccer include increased muscle strength, better agility, and stress reduction. However, there are several cons, including the risk of serious injuries like sprains or concussions, high quitting rates, and potential for pressure. If you think soccer is too hard, think again! If you want to try it, simply join a game at Brain Break to see if its right for you!\n\tNext up, we have another sport that’s popular among CLS students, especially in Bryant’s room. This sport has produced amazing athletes such as Catilin Clark, LeBron James, and Michael Jordan. Give it up for basketball! As with soccer, there are several positions in basketball, the most popular being point guard and forward. Some pros of playing are building stronger bones, increasing cardiovascular health and muscle strength, and practicing social skills.The cons are the intensity of the game, potential for both short and long-term injuries, and long term health issues due to the stress of the game. However, if you have good hand-eye coordination, focus, aim, or you’re a good jumper, basketball may be the sport for you. This sport is also played at Brain Break, so ask if you can join a game. It might be the best decision you’ve made in a while.\n\tThe next sport on the list is not as widely known as the first two, but it’s still popular in Cville. It’s well liked not only by humans, but by dogs as well! These cute, cuddly canines love to chase this ball across the yard or the floor! Listen up, because I’m talking about tennis! Tennis is a game where you hit a ball across a court and over a net. It’s good for those with strong forearms, backhands, and hand-eye coordination. Tennis boosts both physical and mental health, and it also builds up stamina, as well as cognitive health and social development. Nevertheless, there are several cons to playing tennis as well, such as the fact that tennis is rather expensive, due to the cost of lessons, courts, equipment, and tournaments. It can also be very hard to find a partner or a court to play on. The sport also has a high risk of joint injury, especially your wrists, but if you're willing to play, ACAC, Boars Head, and Key West all offer tennis lessons. You can sign up today!\n\tFourth on our docket is rather well known, especially in the spring. While this game is not played at CLS, it’s played in places such as Azalea Park, Washington Park, and Pen Park! Baseball/Softball, take your base! Okay, jokes aside, this game has multiple health benefits, including full-body conditioning, increased hand-eye coordination, and stress relief; as well as the added pros of teamwork, social development, and life skills. Some of the cons of this sport include burnout risk, the fact that pitchers can dominate the game, the pace of the game, and the mental and physical demands of your body. Even with the cons, this is a very popular pastime. For baseball or softball, good reaction times, speed and agility, and teamwork are essential, and strong arms and legs don’t hurt.\n\tOur fifth sport, like tennis, isn’t as popular or well-known as soccer, basketball, and baseball/softball, but it’s certainly a good way to have fun. Ladies, gentlemen, and any other gender identities people may have; it’s lacrosse! For those of you who don’t know what lacrosse is, it’s a sport where people use sticks to throw, catch, carry, and shoot a ball into a goal. So, basically a combo of soccer and basketball with sticks. You need endurance, speed, agility, and strength to play. Some positives of playing are improved cardiovascular health, better coordination and endurance, and lessons and strategy. However, equipment can cost a lot of money, and there’s a high risk of injury. Lacrosse is also a full-time commitment, and there’s a risk of burnout.\n\tOkay folks, last, but definitely not least, is another game that’s incredibly popular at CLS, and no matter what Nico says, it’s not just standing around waiting to hit a ball. Wait for it…volleyball! Volleyball provides a full body workout, including enhancing cardiovascular health, burning calories, and strengthening the muscles of your arms, legs, shoulders, and core! It also builds teamwork and social skills, as well as improving mental health. However, it requires talent, and if you don’t have much natural ability, this might not be the sport for you. Volleyball also needs strategic thinkers, because of the 3-touch rule to hit the ball over the net. That’s not even taking into account the risk of injuries. But, if you have agility, strong arms and legs, and communication and teamwork skills, volleyball could be your sport!\n\tI hope this article on sports inspired you to try one out, but if it didn’t, that’s okay. If none of these sounded appealing to you, do some research. There’s multiple sports out there, and one of them may be calling your name. If you’ve decided sports just aren’t for you, that’s totally fine. There are so many other pastimes that you might love. If you did decide to play one of these sports, amazing! I wish you the best of luck and I hope you love whatever game you tried out. Thanks so much for reading!\n",
    "author": "Avery Fontenot",
    "featured": false,
    "views": 0
  },
  {
    "id": "1st-book-review-1757688447036",
    "title": "1st Book Review and Show Recommendation",
    "category": "Book and Show Recommendation",
    "date": "September 4, 2025",
    "image": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRASWfOYB_zZ1UaXYlJ12waPHgcGp8qznd9frOyNTDm7zdCc05v_jQznDyis6ubgFpCDGUuRQW83K9xv76vOz4EVNIFl9S92bLSOpUeh5mQ",
    "summary": "1st Book Review (Gravity Falls)",
    "fullDescription": "GRAVITY FALLS\nShow Recommendation by Van Ulrich\n\nGravity Falls is a mystery, a comedy, and a really fun time. The show follows twins Dipper and Mabel, and their summer trip to their Grunkle Stan’s Mystery Shack, a tourist trap mystery house. But the town they arrive in may be more strange than they first anticipated. I personally love this show because of the memorable characters that will steal your heart. The only problem I have with this show is that there is a lack of consequences and development with some of the characters' actions. Other than that, Gravity Falls holds a special place in my heart. Full of laughs, heart, and a thrilling mystery: Gravity Falls may be your next binge. (: \n",
    "author": "Van Ulrich",
    "featured": false,
    "views": 0
  },
  {
    "id": "1st-book-and-show-recommedation-1757688131369",
    "title": "1st Book and Show Recommedation",
    "category": "Book and Show Recommendation",
    "date": "September 4, 2025",
    "image": "https://m.media-amazon.com/images/I/81XQynW684L._UF1000,1000_QL80_.jpg",
    "summary": "1st Book Recommendation(Madoka Magica)",
    "fullDescription": "MADOKA MAGICA\nBook Recommendation by Minjii Peterson & Theo Royer\n\n\nMadoka Magica is a PG-14 psychological horror manga (that later got adapted to an anime) about a group of five middle school girls (Madoka Kaname, Homura Akemi, Mami Tomoe, Sayaka Miki, and Kyoko Sakura) who are approached by a creature named Kyubey who gives them the opportunity for any wish to be granted but they have to become a magical girl in return, in which they are forced into a life of killing witches and putting their lives on the line, until they all slowly realize the wish they made isn't worth the price they paid for. Now it's up to them to decide, will they face challenges or be crushed by the consequences? \n\n\nWhy we recommend  it: It's a great series, definitely worth the read and watch. The plot twists really brought it together!”⭐⭐⭐⭐⭐ -Minjii\n\n\n“Great storytelling and perfect for a quick read!”⭐⭐⭐⭐⭐-Theo",
    "author": "Theo Royer & Minjii Peterson",
    "featured": false,
    "views": 0
  },
  {
    "id": "0905",
    "title": "Tal declares war upon cats",
    "category": "Satire",
    "date": "August 27, 2025",
    "image": "https://m.media-amazon.com/images/I/81ArCptOftL.jpg",
    "summary": "Tal declares war upon cats over a cardboard gingerbread house",
    "fullDescription": "In the past few years, tension between Tal and the Council of Kittens has been steadily growing over a cardboard gingerbread house/cat scratcher positioned right in between Tal’s land and the Cat’s Kittendom. Both Tal and the Council of Cats want this, though neither side has made any attempt to capture it. No official war started. Until now.\nA recent attack by the citizens of the Longhair village has broken this fragile peace, and Tal declared war soon after. Tal’s armies, along with being positioned near the gingerbread house, have shown some activity near the maine coon and Scottish-Fold fortresses, and are still awaiting retaliation. The Council of Kittens has contacted the dogs to request help in tearing Tal’s toilet paper. The Dogs, annoyed at the amount of tennis balls that Tal has been hoarding, agreed. Being a hydro superpower, Tal launched a water balloon towards the council of kittens’ base of operations, but the council learned of this attack and evacuated everyone just in time. We will continue this story as events unfold.\n",
    "author": "Bea Bristow",
    "featured": false,
    "views": 0
  },
  {
    "id": "cutbackdaplants",
    "title": "Time To Cut Back!",
    "category": "Opinion",
    "date": "September 5, 2025",
    "image": "https://www.ultraplay.com/uploads/products/_productCardDesktop1x/1-Bay-Bipod-straps.jpg",
    "summary": "Why we need to cut back the plants behind the swings",
    "fullDescription": "Picture this: Your best friend is on the swingset during Brain Break, and she just misses kicking someone walking by in the head, but since her legs are bent, she’s up to her knees in the bushes. When she swings back up again, one of her legs is bleeding! How, though? She was cut by a sharp branch!\nThis grisly scenario could become reality if the plants behind the swings aren’t cut back. The bushes and branches have become a safety hazard to anyone wishing to have fun on the swings. People could get scratched, get bug bites, or even have vines loop around their body parts. Soccer balls can also get lost in the tangle. Multiple students are unhappy about this.\n“I was swinging once and a vine looped around my neck,” says  a student who prefers to remain anonymous. “I almost got pulled off the swing!”\nThat could have ended in disaster, and that’s not the only way a student could get hurt on the swings. Those plants are a lawsuit waiting to happen. It’s even worse this year, since they were left to grow uncultivated for an entire summer. Imagine if a nest of bees moved in, or if poison ivy started to grow! We’ve already had one student injured on the swings this year, and if these plants aren’t cut back, they won’t be the last.\nAnother reason the plants should be cut back is that balls keep getting lost in there, and students have to go into the unknown to get them back. That could be dangerous. We aren’t allowed to go into the woods to get balls back, so why should we have to go into the plants to get them? All of these problems can be resolved by just cutting back the plants. \n",
    "author": "Avery Fontenot",
    "featured": false,
    "views": 0
  }
]